## Pandas

- Means PanelData
- One of the data scinece pakages
- Used for Data manupulation, analysis and cleaning
- Contains mainly two data structures in it
    - 1.Series
    - 2.DataFrames
- A series is a sequnece of data
- A data frame is data with rows and columns

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.0.5'

### Converting datastructures into series

In [4]:
s = 'hello'
print(pd.Series(s))

0    hello
dtype: object

In [5]:
s1 = 'hi good morning all'.split()
pd.Series(s1)

0         hi
1       good
2    morning
3        all
dtype: object

In [6]:
s2 = 'hi good morning all'.split()
pd.Series(s1, index = [1,2,3,4])

1         hi
2       good
3    morning
4        all
dtype: object

In [7]:
li = [123,'name',9.6]
pd.Series(li)

0     123
1    name
2     9.6
dtype: object

In [8]:
# int 123
# str name
# float 9.6

li1 = [123,'name',9.6]
pd.Series(li1, index = ('int','str','float'))

int       123
str      name
float     9.6
dtype: object

In [9]:
t = ('a','e','i','o','u')
pd.Series(t,index = ['vow1','vow2','vow3','vow4','vow5'])

vow1    a
vow2    e
vow3    i
vow4    o
vow5    u
dtype: object

In [12]:
dic = {'key1':123,'key2':'hello','key3':4.3}
pd.Series(dic)

key1      123
key2    hello
key3      4.3
dtype: object

### Converting data structures into DataFrames

In [13]:
a = 'hi good morning'.split()
pd.DataFrame(a)

         0
0       hi
1     good
2  morning

In [15]:
t = ('a','b','c')
pd.DataFrame(t,index = [1,2,3])

   0
1  a
2  b
3  c

In [16]:
d = {'k1':123,'k2':'abc','k3':6.5}
pd.DataFrame(d,index=[1,2,3])

    k1   k2   k3
1  123  abc  6.5
2  123  abc  6.5
3  123  abc  6.5

In [17]:
import numpy as np
ar = np.arange(4,10)
pd.Series(ar)

0    4
1    5
2    6
3    7
4    8
5    9
dtype: int32

In [ ]:
       Name  Marks Id
Stu1   --     --  --
Stu2   --     --  --
Stu3   --     --  --

In [18]:
dic2 = {'Name':['Nandini','Poojitha','Neeraja'],'Marks':[67,89,98],'Id':['N130663','N130664','N130665']}
pd.DataFrame(dic2,index = ['Stu1','Stu2','Stu3'])

          Name  Marks       Id
Stu1   Nandini     67  N130663
Stu2  Poojitha     89  N130664
Stu3   Neeraja     98  N130665

### Data Analysis and Manupulation

In [2]:
df1 = pd.DataFrame({"No_of_heros":[2,1,2,3],
                   'No_of_persons':[50,45,45,67]},
                  index = [1999,2000,2001,2010])
df1

      No_of_heros  No_of_persons
1999            2             50
2000            1             45
2001            2             45
2010            3             67

In [3]:
df2 = pd.DataFrame({"No_Days":[80,90,70,60],
                   'Rating':[1,3,5,6]},
                  index = [1998,2000,2020,2030])
df2

      No_Days  Rating
1998       80       1
2000       90       3
2020       70       5
2030       60       6

In [4]:
df2.join(df1)

      No_Days  Rating  No_of_heros  No_of_persons
1998       80       1          NaN            NaN
2000       90       3          1.0           45.0
2020       70       5          NaN            NaN
2030       60       6          NaN            NaN

In [21]:
df1.join(df2)

      No_of_heros  No_of_persons  No_Days  Rating
1999            2             50      NaN     NaN
2000            1             45     90.0     3.0
2001            2             45      NaN     NaN
2010            3             67      NaN     NaN

In [25]:
df3 = pd.DataFrame({'a':[80,90,60,70],
                   'b':[2,1,2,3]},
                   index = [2001,2002,2003,2004])
df3

       a  b
2001  80  2
2002  90  1
2003  60  2
2004  70  3

In [26]:
df4 = pd.DataFrame({'a':[80,90,75,70],
                   'b':[2,1,2,3]},
                   index = [2001,2002,2003,2004])
df4

       a  b
2001  80  2
2002  90  1
2003  75  2
2004  70  3

In [27]:
df3.merge(df4)

    a  b
0  80  2
1  90  1
2  70  3

In [6]:
con = pd.concat((df1,df2))
con

      No_of_heros  No_of_persons  No_Days  Rating
1999          2.0           50.0      NaN     NaN
2000          1.0           45.0      NaN     NaN
2001          2.0           45.0      NaN     NaN
2010          3.0           67.0      NaN     NaN
1998          NaN            NaN     80.0     1.0
2000          NaN            NaN     90.0     3.0
2020          NaN            NaN     70.0     5.0
2030          NaN            NaN     60.0     6.0

In [7]:
dates = pd.date_range('2021-06-01','2021-06-05')
pd.Series(dates,index=['Day1','Day2','Day3','Day4','Day5'])

Day1   2021-06-01
Day2   2021-06-02
Day3   2021-06-03
Day4   2021-06-04
Day5   2021-06-05
dtype: datetime64[ns]

In [8]:
for i in range(1,5):
    print(i,end=' ')

1 2 3 4

In [9]:
temp = pd.Series([32,34,30,37,40,35,40])

In [12]:
temp[4]

40